# Data Selection (iloc)
Use location(integer) to choose row and column

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Application Number')
df

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#2,Jason,A2,198,100,82,78,88,NaN
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R
#8,Poppy,A1,180,80,90,70,89,Python

In [2]:
df.iloc[0]

Name          Ian
School         A1
Height        178
English        90
Math          100
Biology        88
Finance        95
Coding     Python
Name: #1, dtype: object

In [3]:
df.iloc[4]

Name       Kara
School       A1
Height      201
English      82
Math         78
Biology      88
Finance      84
Coding      NaN
Name: #5, dtype: object

In [4]:
df.iloc[2:5]

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN

In [5]:
df.iloc[0, 1]

'A1'

In [6]:
df.iloc[0, [2, 5]]

Height     178
Biology     88
Name: #1, dtype: object

In [7]:
df.iloc[[0, 2],[1, 4]]

                   School  Math
Application Number
#1                     A1   100
#3                     A2    87

In [8]:
df.iloc[0:4, 2:7]

                    Height  English  Math  Biology  Finance
Application Number
#1                     178       90   100       88       95
#2                     198      100    82       78       88
#3                     168       85    87       90       75
#4                     188       70    65       95       92